<a href="https://colab.research.google.com/github/rochinha23/Curso-Data-Science-e-Machine-Learning-com-Estatistica-e-Python/blob/main/pandas_treino.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [15]:
import pandas as pd #importando a biblioteca pandas

In [16]:
from google.colab import files #como estou no google colab Ã© necesssario fazer este passo antes
uploaded = files.upload()

Saving train.csv to train (1).csv

In [17]:
import io

In [18]:
data = pd.read_csv(io.BytesIO(uploaded['train.csv'])) #armazendando na variavel data o arquivo

In [19]:
data.head() #vendo as primeiras linhas do arquivo,podemos escolher colocando o numero dentro do parenteses

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [20]:
data.tail() #exibi as ultimas linhas, podemos escolher(o numero de linhas) colocando o numero dentro do paratenses

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
886          887         0       2  ...  13.00   NaN         S
887          888         1       1  ...  30.00   B42         S
888          889         0       3  ...  23.45   NaN         S
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[5 rows x 12 columns]

In [21]:
data.info() #informaÃ§Ãµes sobre o dataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

**Resumo EstatÃ­stico de Campos NumÃ©ricos**

In [22]:
data.describe() #visÃ£o geral dos dados estatisticos

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

**Resumo estatÃ­stico de campos CategÃ³ricos**

In [23]:
data.describe(include='O')

                                Name   Sex  Ticket        Cabin Embarked
count                            891   891     891          204      889
unique                           891     2     681          147        3
top     Panula, Master. Eino Viljami  male  347082  C23 C25 C27        S
freq                               1   577       7            4      644

**Renomear colunas**

In [24]:
data.head(2)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C

[2 rows x 12 columns]

In [25]:
data.rename({'Name':'Nome','Sex':'Sexo'},axis=1, inplace = True) #renomear, axis=0 mudar nome linhas, axis=1 mudar nome da coluna,inplace=True muda definitivamente e todos os lugares

**Outra forma de mudar o nome das colunas**

In [26]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Nome', 'Sexo', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [27]:
data.columns = ['IdPassageiro', 'Sobreviveu', 'Classe', 'Nome', 'Sexo', 'Idade', 
                'IrmaosConjuge', 'PaisFilhos', 'Bilhete', 'Tarifa', 'Cabine', 'Embarque']

In [28]:
data.head(3)

   IdPassageiro  Sobreviveu  Classe  ...   Tarifa Cabine  Embarque
0             1           0       3  ...   7.2500    NaN         S
1             2           1       1  ...  71.2833    C85         C
2             3           1       3  ...   7.9250    NaN         S

[3 rows x 12 columns]

In [29]:
data.columns

Index(['IdPassageiro', 'Sobreviveu', 'Classe', 'Nome', 'Sexo', 'Idade',
       'IrmaosConjuge', 'PaisFilhos', 'Bilhete', 'Tarifa', 'Cabine',
       'Embarque'],
      dtype='object')

**Selecionando Colunas Especificas**

In [30]:
data[['Nome','Sexo','Classe','Tarifa','Idade','Sobreviveu']].head(3)

                                                Nome    Sexo  ...  Idade  Sobreviveu
0                            Braund, Mr. Owen Harris    male  ...   22.0           0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  ...   38.0           1
2                             Heikkinen, Miss. Laina  female  ...   26.0           1

[3 rows x 6 columns]

In [31]:
data['Sexo'] #para apenas uma coluna, data series

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sexo, Length: 891, dtype: object

**FunÃ§Ãµes matemÃ¡ticas embutidas**

In [32]:
data['Idade'].mean() #media

29.69911764705882

In [33]:
data['Idade'].sum() #soma

21205.17

In [34]:
data['Idade'].count() #contar

714

In [35]:
data['Idade'].median() #mediana

28.0

In [36]:
data['Idade'].mode() #moda

0    24.0
dtype: float64

In [37]:
data['Idade'].max() #idade maxima

80.0

In [38]:
data['Idade'].min() #idade minima

0.42

In [39]:
data['Idade'].idxmin() #index da menor idade

803

In [40]:
data['Idade'].idxmax() #index da maior idade

630

In [41]:
data.mean()

IdPassageiro     446.000000
Sobreviveu         0.383838
Classe             2.308642
Idade             29.699118
IrmaosConjuge      0.523008
PaisFilhos         0.381594
Tarifa            32.204208
dtype: float64

In [42]:
data.sum()

IdPassageiro                                                397386
Sobreviveu                                                     342
Classe                                                        2057
Nome             Braund, Mr. Owen HarrisCumings, Mrs. John Brad...
Sexo             malefemalefemalefemalemalemalemalemalefemalefe...
Idade                                                      21205.2
IrmaosConjuge                                                  466
PaisFilhos                                                     340
Bilhete          A/5 21171PC 17599STON/O2. 31012821138033734503...
Tarifa                                                     28693.9
dtype: object

In [43]:
data.median()

IdPassageiro     446.0000
Sobreviveu         0.0000
Classe             3.0000
Idade             28.0000
IrmaosConjuge      0.0000
PaisFilhos         0.0000
Tarifa            14.4542
dtype: float64

In [44]:
data.min()

IdPassageiro                       1
Sobreviveu                         0
Classe                             1
Nome             Abbing, Mr. Anthony
Sexo                          female
Idade                           0.42
IrmaosConjuge                      0
PaisFilhos                         0
Bilhete                       110152
Tarifa                             0
dtype: object

In [45]:
data.max()

IdPassageiro                             891
Sobreviveu                                 1
Classe                                     3
Nome             van Melkebeke, Mr. Philemon
Sexo                                    male
Idade                                     80
IrmaosConjuge                              8
PaisFilhos                                 6
Bilhete                            WE/P 5735
Tarifa                               512.329
dtype: object

In [46]:
data.idxmin() #para data frame nÃ£o funciona o idxmin e idxmax

TypeError: ignored

**Selecionando pelo Index - iloc**

In [47]:
data.iloc[630]

IdPassageiro                                      631
Sobreviveu                                          1
Classe                                              1
Nome             Barkworth, Mr. Algernon Henry Wilson
Sexo                                             male
Idade                                              80
IrmaosConjuge                                       0
PaisFilhos                                          0
Bilhete                                         27042
Tarifa                                             30
Cabine                                            A23
Embarque                                            S
Name: 630, dtype: object

In [48]:
data.iloc[803]

IdPassageiro                                 804
Sobreviveu                                     1
Classe                                         3
Nome             Thomas, Master. Assad Alexander
Sexo                                        male
Idade                                       0.42
IrmaosConjuge                                  0
PaisFilhos                                     1
Bilhete                                     2625
Tarifa                                    8.5167
Cabine                                       NaN
Embarque                                       C
Name: 803, dtype: object

In [49]:
data.iloc[[803]]

     IdPassageiro  Sobreviveu  Classe  ...  Tarifa Cabine  Embarque
803           804           1       3  ...  8.5167    NaN         C

[1 rows x 12 columns]

In [50]:
data.iloc[[630,70,803,80]]

     IdPassageiro  Sobreviveu  Classe  ...   Tarifa Cabine  Embarque
630           631           1       1  ...  30.0000    A23         S
70             71           0       2  ...  10.5000    NaN         S
803           804           1       3  ...   8.5167    NaN         C
80             81           0       3  ...   9.0000    NaN         S

[4 rows x 12 columns]

In [51]:
data.iloc[1:3]

   IdPassageiro  Sobreviveu  Classe  ...   Tarifa Cabine  Embarque
1             2           1       1  ...  71.2833    C85         C
2             3           1       3  ...   7.9250    NaN         S

[2 rows x 12 columns]

In [52]:
data['Nome'].iloc[2] #para ver uma informaÃ§Ã£o em especifico

'Heikkinen, Miss. Laina'

**Operador de seleÃ§Ã£o "loc"**

In [53]:
data[['Idade','Sexo','Tarifa', 'Classe','Sobreviveu']].loc[data['Sexo']=='male'].head()

   Idade  Sexo   Tarifa  Classe  Sobreviveu
0   22.0  male   7.2500       3           0
4   35.0  male   8.0500       3           0
5    NaN  male   8.4583       3           0
6   54.0  male  51.8625       1           0
7    2.0  male  21.0750       3           0

In [54]:
data[['Nome','Sexo','Tarifa','Classe','Sobreviveu']]\
.loc[(data['Idade']>=3) & (data['Idade']<=10) & (data['Sobreviveu']==0)]

                                        Nome    Sexo  ...  Classe  Sobreviveu
24             Palsson, Miss. Torborg Danira  female  ...       3           0
50                Panula, Master. Juha Niilo    male  ...       3           0
63                     Skoog, Master. Harald    male  ...       3           0
147         Ford, Miss. Robina Maggie "Ruby"  female  ...       3           0
171                     Rice, Master. Arthur    male  ...       3           0
182    Asplund, Master. Clarence Gustaf Hugo    male  ...       3           0
278                       Rice, Master. Eric    male  ...       3           0
374               Palsson, Miss. Stina Viola  female  ...       3           0
419                Van Impe, Miss. Catharina  female  ...       3           0
480           Goodwin, Master. Harold Victor    male  ...       3           0
541     Andersson, Miss. Ingeborg Constanzia  female  ...       3           0
634                       Skoog, Miss. Mabel  female  ...       3           0
787                Rice, Master. George Hugh    male  ...       3           0
813       Andersson, Miss. Ebba Iris Alfrida  female  ...       3           0
819             Skoog, Master. Karl Thorsten    male  ...       3           0
850  Andersson, Master. Sigvard Harald Elias    male  ...       3           0
852                  Boulos, Miss. Nourelain  female  ...       3           0

[17 rows x 5 columns]

In [55]:
data[['Idade', 'Sexo', 'Classe', 'Sobreviveu']]\
.loc[(data['Idade']>14) & (data['Sobreviveu']==1)].count()

Idade         245
Sexo          245
Classe        245
Sobreviveu    245
dtype: int64

**map e replace**

In [56]:
data['Sexo'].map({'male':'homem', 'female': 'mulher'}) #substitui os nomes,ainda nÃ£o foi aplicado

0       homem
1      mulher
2      mulher
3      mulher
4       homem
        ...
886     homem
887    mulher
888    mulher
889     homem
890     homem
Name: Sexo, Length: 891, dtype: object

In [58]:
data['Sexo'].replace({'male':'homem', 'female': 'mulher'}) #substitui os nome

0       homem
1      mulher
2      mulher
3      mulher
4       homem
        ...
886     homem
887    mulher
888    mulher
889     homem
890     homem
Name: Sexo, Length: 891, dtype: object

In [64]:
data['Sexo'].replace(['male','female'], ['homem','mulher'], inplace=True) #substitui os nome

In [65]:
data['Sexo']

0       homem
1      mulher
2      mulher
3      mulher
4       homem
        ...
886     homem
887    mulher
888    mulher
889     homem
890     homem
Name: Sexo, Length: 891, dtype: object

In [61]:
#data['Sexo'] = data['Sexo'].map({'homem':'male', 'mulher': 'female'})

In [66]:
data['Sexo']

0       homem
1      mulher
2      mulher
3      mulher
4       homem
        ...
886     homem
887    mulher
888    mulher
889     homem
890     homem
Name: Sexo, Length: 891, dtype: object

In [69]:
data.groupby('Sexo').mean()

        IdPassageiro  Sobreviveu  ...  PaisFilhos     Tarifa
Sexo                              ...
homem     454.147314    0.188908  ...    0.235702  25.523893
mulher    431.028662    0.742038  ...    0.649682  44.479818

[2 rows x 7 columns]

In [70]:
data.groupby('Sobreviveu').mean()

            IdPassageiro    Classe  ...  PaisFilhos     Tarifa
Sobreviveu                          ...
0             447.016393  2.531876  ...    0.329690  22.117887
1             444.368421  1.950292  ...    0.464912  48.395408

[2 rows x 6 columns]

In [71]:
data.groupby('Classe').mean()

        IdPassageiro  Sobreviveu  ...  PaisFilhos     Tarifa
Classe                            ...
1         461.597222    0.629630  ...    0.356481  84.154687
2         445.956522    0.472826  ...    0.380435  20.662183
3         439.154786    0.242363  ...    0.393075  13.675550

[3 rows x 6 columns]

In [75]:
data.groupby(['Sexo','Classe']).mean()

               IdPassageiro  Sobreviveu  ...  PaisFilhos      Tarifa
Sexo   Classe                            ...
homem  1         455.729508    0.368852  ...    0.278689   67.226127
       2         447.962963    0.157407  ...    0.222222   19.741782
       3         455.515850    0.135447  ...    0.224784   12.661633
mulher 1         469.212766    0.968085  ...    0.457447  106.125798
       2         443.105263    0.921053  ...    0.605263   21.970121
       3         399.729167    0.500000  ...    0.798611   16.118810

[6 rows x 6 columns]

In [76]:
data.groupby(['Sexo','Classe']).mean().shape

(6, 6)